appserver/tests/payara-samples/samples/jaxws-security/src/test/resources/fish/payara/samples/jaxws/security/ejb/request.xml

<soapenv:Envelope xmlns:calc="http://ejb.security.jaxws.samples.payara.fish/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-8E811395F6146BEFC6158533756176854">
            <wsse:Username>tester</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <calc:hello/>
   </soapenv:Body>
</soapenv:Envelope>
